k = {
    'a' : ['あ', 'ア'], 'i' : ['い', 'イ'], 'u' : ['う', 'ウ'], 'e' : ['え', 'エ'], 'o' : ['お', 'オ'],
    'ka': ['か', 'カ'], 'ki': ['き', 'キ'], 'ku': ['く', 'ク'], 'ke': ['け', 'ケ'], 'ko': ['こ', 'コ'],
    'sa': ['さ', 'サ'], 'shi':['し', 'シ'], 'su': ['す', 'ス'], 'se': ['せ', 'セ'], 'so': ['そ', 'ソ'],
    'ta': ['た', 'タ'], 'chi':['ち', 'ち'], 'tsu':['つ', 'つ'], 'te': ['て', 'て'], 'to': ['と', 'ト'],
    'na': ['な', 'ナ'], 'ni': ['に', 'ニ'], 'nu': ['ぬ', 'ヌ'], 'ne': ['ね', 'ネ'], 'no': ['の', 'ノ'],
    'ha': ['は', 'ハ'], 'hi': ['ひ', 'ヒ'], 'fu': ['ふ', 'フ'], 'he': ['へ', 'ヘ'], 'ho': ['ほ', 'ホ'],
    'ma': ['ま', 'マ'], 'mi': ['み', 'ミ'], 'mu': ['む', 'ム'], 'me': ['め', 'メ'], 'mo': ['も', 'モ'],
    'ya': ['や', 'ヤ'],                     'yu': ['ゆ', 'ユ'],                     'yo': ['よ', 'ヨ'],
    'ra': ['ら', 'ラ'], 'ri': ['り', 'リ'], 'ru': ['る', 'ル'], 're': ['れ', 'レ'], 'ro': ['ろ', 'ロ'],
    'wa': ['わ', 'ワ'], 'wi': ['ゐ', 'ヰ'],                     'we': ['ゑ', 'ヱ'], 'wo': ['を', 'ヲ'],

    'n':  ['ん', 'ン'],

    'ga': ['が', 'ガ'], 'za': ['ざ', 'ザ'], 'da': ['だ', 'ダ'], 'ba': ['ば', 'バ'], 'pa': ['ぱ', 'パ'],
    'gi': ['ぎ', 'ギ'], 'zi': ['じ', 'ジ'], 'di': ['ぢ', 'ヂ'], 'bi': ['び', 'ビ'], 'pi': ['ぴ', 'ピ'],
    'gu': ['ぐ', 'グ'], 'zu': ['ず', 'ズ'], 'du': ['づ', 'ヅ'], 'bu': ['ぶ', 'ブ'], 'pu': ['ぷ', 'プ'],
    'ge': ['げ', 'ゲ'], 'ze': ['ぜ', 'ゼ'], 'de': ['で', 'デ'], 'be': ['べ', 'ベ'], 'pe': ['ぺ', 'ペ'],
    'go': ['ご', 'ゴ'], 'zo': ['ぞ', 'ゾ'], 'do': ['ど', 'ド'], 'bo': ['ぼ', 'ボ'], 'po': ['ぽ', 'ポ'],
}

r = [
    'a',  'i',  'u',  'e',  'o',
    'ka', 'ki', 'ku', 'ke', 'ko',
    'sa', 'shi','su', 'se', 'so',
    'ta', 'chi','tsu','te', 'to',
    'na', 'ni', 'nu', 'ne', 'no',
    'ha', 'hi', 'fu', 'he', 'ho',
    'ma', 'mi', 'mu', 'me', 'mo',
    'ya',       'yu',       'yo',
    'ra', 'ri', 'ru', 're', 'ro',
    'wa', 'wi',       'we', 'wo',

    'n',

    'ga', 'za', 'da', 'ba', 'pa',
    'gi', 'zi', 'di', 'bi', 'pi',
    'gu', 'zu', 'du', 'bu', 'pu',
    'ge', 'ze', 'de', 'be', 'pe',
    'go', 'zo', 'do', 'bo', 'po',
 ]

def romanji(k):
    pass

def kana(r):
    return k[r[0]][r[1]]
